## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.orchestrator will be created
  + resource "aws_ecr_lifecycle_policy" "orchestrator" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "sha-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "aws-python-orchestrator"
    }

  # aws_ecr_repository.orchestrator must be replaced
-/+ resource "aws_ecr_repository" "orchestrator" {
      ~ arn                  = "arn:aws:ecr:us-east-1:886360753244:repository/aws-java-orchestrator" -> (known after apply)
      ~ id                   = "aws-java-orchestrator" -> (known after apply)
      ~ name                 = "aws-java-orchestrator" -> "aws-python-orchestrator" # forces replacement
      ~ registry_id          = "886360753244" -> (known after apply)
      ~ repository_url       = "886360753244.dkr.ecr.us-east-1.amazonaws.com/aws-java-orchestrator" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_alias.prod will be created
  + resource "aws_lambda_alias" "prod" {
      + arn              = (known after apply)
      + function_name    = "aws-python-orchestrator"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "prod"
      + region           = "us-east-1"
    }

  # aws_lambda_event_source_mapping.orchestrator_sqs_trigger will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "orchestrator_sqs_trigger" {
      ~ function_name                      = "arn:aws:lambda:us-east-1:886360753244:function:aws-java-orchestrator" -> (known after apply)
        id                                 = "5457c469-9adc-4474-9460-469c3004010b"
        tags                               = {}
        # (24 unchanged attributes hidden)
    }

  # aws_lambda_function.orchestrator will be created
  + resource "aws_lambda_function" "orchestrator" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "aws-python-orchestrator"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::886360753244:role/aws-python-orchestrator-lambda-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENV" = "prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>